==================
boolean
==================
true
false
---

(expression
  (boolean)
  (boolean))

==================
null
==================
null
---

(expression
  (null))

==================
number
==================
711
-9.2
0xff
-2.99e-2
---

(expression
  (number)
  (number)
  (number)
  (number))

==================
string
==================
''
'Example string'
'It''s open source!'
---

(expression
  (string)
  (string
    (string_content))
  (string
    (string_content)
    (scape_sequence)
    (string_content)))
