=======
integer
=======
if: 711
---

(source
  (expression
    (literal
      (number))))

===================
integer (delimited)
===================
if: ${{ 711 }}
---
(source
  (delimited_expression
    (literal
      (number))))

=====
float
=====
if: -9.2
---

(source
  (expression
    (literal
      (number))))
===
hex
===
if: 0xff
---

(source
  (expression
    (literal
      (number))))

===========
exponential
===========
if: -2.99e-2
---

(source
  (expression
    (literal
      (number))))
