=====
empty
=====
if: ''
---

(pair
  (expression
    (literal
      (string))))

==================
emplty (delimited)
==================
if: ${{ '' }}
---
(pair
  (delimited_expression
    (literal
      (string))))

======
normal
======
if: 'Example string'
---

(pair
  (expression
    (literal
      (string
        (string_content)))))
===========
quote scape
===========
if: 'It''s open pair!'
---

(pair
  (expression
    (literal
      (string
        (string_content)
        (scape_sequence)
        (string_content)))))
